# St7GetNLAStagedAnalysis

Returns the state of the staged analysis option for nonlinear static analysis.

long St7GetNLAStagedAnalysis(long uID, bool* StagedAnalysis)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
StagedAnalysis
True if staged analysis is active.